{
  "description": "Web технологии изучал самостоятельно и применял их на практике в реализации двух командных проектов в университете, где брал на себя роль Fullstack разработчика и руководителя проекта.<br><br>Начинал с языка PHP с применением JS на основе полученной базы в университете по C++ и C#.<br><br>Продолжил развиваться в стеке Frontend разработчика на JS, закрепил и получил необходимые навыки на практике курса от Innopolis University. Основные навыки развиты в таких технологиях, как JS, TS, React, MobX, CSS, SCSS и HTML.<br><br>Знаю клиент-серверное взаимодействие. Имею навыки в коммерческой разработке приложений на React с применением стейтменеджера MobX. Помимо MobX знаком с Redux по опыту разработки петпроекта. На практике применял такие UI как Bootstrap, Semantic и Ant Design. Для автотестов применял Jest. Знаком с технологией СУБД MySQL, а также с проектированием и методологиями моделирования. Работал по Agile методологии в JIRA.",
  "skills": {
    "key": [
      "React",
      "React Native",
      "MobX",
      "TypeScript",
      "JavaScript",
      "CSS",
      "SCSS",
      "HTML",
      "Git",
      "БЭМ",
      "Git-Flow"
    ],
    "additional": [
      "Redux",
      "Jest",
      "Express",
      "CI",
      "Native Base",
      "Bootstrap",
      "Semantic UI",
      "AntD"
    ]
  },
  "experience": [
    {
      "period": "01/2021 по текущее время",
      "place": "ООО \"Финансовые информационные системы\"",
      "direction": "Web-разработчик",
      "info": "1) Поддержка легаси и разработка модулей для банка Volkswagen Financial Services по методологии Agile.<br/><b>Технологии</b>: React (классовые и функциональные компоненты), MobX, CSSinJS, Git, Antd, Material-UI.<br/>2) Разработка и поддержка виджетов для FIS Platform (Case Studio).<br/><b>Технологии</b>: TypeScript, JavaScript, SCSS, Git.<br/>3) Мобильная разработка.<br/><b>Технологии</b>: React-Native (функциональные компоненты), TypeScript, MobX, Native Base, SCSS, Git."
    }
  ],
  "education": [
    {
      "period": "2017 - 2021",
      "place": "УГАТУ",
      "direction": "Программная инженерия",
      "info": "Диплом бакалавра о высшем образовании с отличием"
    }
  ],
  "training": [
    {
      "period": "09/2021",
      "place": "Нетология",
      "direction": "Основы верстки сайта",
      "info": "Сертификат"
    },
    {
      "period": "09/2021",
      "place": "ITEA ONLINE",
      "direction": "HTML&CSS мастер-класс",
      "info": "Сертификат"
    },
    {
      "period": "09/2021 - 12/2021",
      "place": "Innopolis University",
      "direction": "Промышленная разработка приложений на JavaScript",
      "info": "Диплом о профессиональной переподготовке"
    }
  ],
  "portfolio": [
    {
      "nameProject": "Delta-World",
      "imgURL": "img/portfolio/5.png",
      "about": "Практическое web-приложение по изученным основным технологиям на курсе от Innopolis University",
      "year": 2021,
      "role": "Fullstack",
      "technologies": "React, Redux, TS, SCSS, БЭМ, Node, Express, Jest",
      "repositoryURL": "https://github.com/FatherAntelope/delta-world",
      "websiteURL": null
    },
    {
      "nameProject": "Сатурн. МИС",
      "imgURL": "img/portfolio/1.svg",
      "about": "Данное web-приложение представляет из себя медицинскую информационную систему для пациентов, проходящих процесс реабилитации или отдыха в санатории, для медицинского персонала, контролирующей процесс реабилитации или отдыха пациентов в санатории и для администрации, занимающейся обслуживанием сопровождения процесса реабилитации.\nПроект реализовывался в рамках выпускной квалификационной работы по направлению \"Программная инженерия\".",
      "year": 2021,
      "role": "Fullstack",
      "technologies": "JS, PHP, CSS, HTML, Bootstrap 4, jQuery&Ajax",
      "repositoryURL": "https://github.com/fatherantelope/saturn-mis",
      "websiteURL": null
    },
    {
      "nameProject": "Landing portfolio page",
      "imgURL": "img/portfolio/2.svg",
      "about": "Первая версия лендинга моего портфолио. Отражает набросок моих первоначальных идей для дополнения к резюме.",
      "year": 2020,
      "role": "Frontend",
      "technologies": "HTML, CSS",
      "repositoryURL": "https://github.com/fatherantelope/fatherantelopev1.github.io",
      "websiteURL": null
    },
    {
      "nameProject": "HeartBlaze",
      "imgURL": "img/portfolio/3.svg",
      "about": "Web-приложение для кафедры физической культуры ФГБОУ ВО \"Уфимского Государственного Авиационного Технического Университета\". Направлено на студентов и преподавателей данной кафедры с целью контроля физической активности во время занятий.\nПроект временно использовался мною и другими студентами из моей спортивной секции.",
      "year": 2020,
      "role": "Fullstack",
      "technologies": "JS, PHP, CSS, HTML, MySQL, Semantic UI, jQuery&Ajax",
      "repositoryURL": "https://github.com/fatherantelope/heartblazev2",
      "websiteURL": null
    },
    {
      "nameProject": "Прямая и плоскость",
      "imgURL": "img/portfolio/4.svg",
      "about": "Десктопное программное обеспечение, отражающее взаимодействие прямой с плоскостью, а то есть их пересечение. Для расчетов были использованы основы тригонометрии, геометрии и дискретной математики.",
      "year": 2019,
      "role": "C# Dev",
      "technologies": "C#, Windows Forms",
      "repositoryURL": "https://github.com/fatherantelope/straight-flat-intersection",
      "websiteURL": null
    }
  ],
  "contacts": {
    "email": "gorbunov.vladlen2014@gmail.com",
    "phone_number": ""
  }
}
